FemDesign.Calculate.CombItem
fdscript.xsd
ANALCOMBITEM

FemDesign.Calculate.CombItem.#ctor
Parameterless constructor for serialization.

FemDesign.Calculate.CombItem.#ctor(System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Int32,System.Int32)
Load combination-specific settings for calculations.
impfRqd: Required imperfection shapes.
stabReq: Required buckling shapes for stability analysis.
NLE: Consider elastic nonlinear behaviour of structural elements.
PL: Consider plastic behaviour of structural elements.
NLS: Consider nonlinear behaviour of soil.
Cr: Cracked section analysis. Note that Cr only executes properly in RCDesign with DesignCheck set to true.
f2nd: 2nd order analysis.
Im: Imperfection shape for 2nd order analysis.
waterlevel: Ground water level.